# **Pandas**

# **Introduction:**
- pandas is a powerful Python library for data manipulation and analysis, providing easy-to-use structures like DataFrames and Series.

- It is a **one-dimensond (1-D) array** holding data of any type.
- A Pandas Series is like a column in a table

## **Installation :**

**Step 1: Install pandas (if not installed)**
- If you haven't installed pandas yet, you can install it using the following command:

`pip install pandas`

**Step 2: Importing pandas**
        
`import pandas as pd`

In [12]:
import pandas as pd
import numpy as np

**1) Creating a Pandas Series from a List :**

In [14]:
# Create a Series from a list
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

# Print the Series
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

**Type of Series**

In [16]:
# Check the type of the Series
print("\nType of series:", type(series))

Type of series: <class 'pandas.core.series.Series'>

**Data type in Series:**

In [18]:
# Check the data type of the elements in the Series
print("Data type of series elements:", series.dtype)

Data type of series elements: int64

**Shape**

In [20]:
# Check the shape of the elements in the Series
print("Shape of series elements:", series.shape)

Shape of series elements: (5,)

**Custom Indexing**

In [22]:
import pandas as pd

# Create a list
data = [10, 20, 30, 40, 50]

# Create a Series with a custom index
series = pd.Series(data, index=["a", "b", "c", "d", "e"])

# Print the Series
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

__________

**2. Creating pandas Series using 1-D Array :**

In [25]:

data= np.array([10,20,30,40,50])
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int32

**Type of Series**

In [27]:
# Check the type of the Series
print("\nType of series:", type(series))

Type of series: <class 'pandas.core.series.Series'>

**Data type in Series:**

In [29]:
# Check the data type of the elements in the Series
print("Data type of series elements:", series.dtype)

Data type of series elements: int32

**Shape**

In [31]:
# Check the shape of the elements in the Series
print("Shape of series elements:", series.shape)

Shape of series elements: (5,)

**Custom Indexing**

In [33]:
data = [10,20,30,40,50,60]
series=pd.Series(data,index=["a","b","c","d","e","f"])
print(series)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

**OR**

In [35]:
# Create a Series with a custom index
data = [10, 20, 30, 40, 50,60]
index = ['a', 'b', 'c', 'd', 'e','f']
series = pd.Series(data, index=index)
print(series)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

____________

**3) Creating Series using Dictionary :**

In [38]:
data = {'a':1,'b':2,'c':3,'d':4,'e':5,'f':6}
series= pd.Series(data)
print(series)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

**Type of Series**

In [40]:
# Check the type of the Series
print("\nType of series:", type(series))

Type of series: <class 'pandas.core.series.Series'>

**Data type in Series:**

In [42]:
# Check the data type of the elements in the Series
print("Data type of series elements:", series.dtype)

Data type of series elements: int64

**Shape**

In [44]:
# Check the shape of the elements in the Series
print("Shape of series elements:", series.shape)

Shape of series elements: (6,)

________

**4. Specifying Data Types in a Series (int , float, double )**

In [47]:
# Create a Series and specify the data type
print("Printing for int")
data = [10, 20, 30, 40, 50]
series = pd.Series(data, dtype='int32')
print(series)

Printing for int
0    10
1    20
2    30
3    40
4    50
dtype: int32

In [48]:
# Create a Series and specify the data type
print("Printing for Float")
data = [10, 20, 30, 40, 50]
series = pd.Series(data, dtype='float64')
print(series)

Printing for Float
0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

In [49]:
# Create a Series and specify the data type
print("Printing for double")
data = [10, 20, 30, 40, 50]
series = pd.Series(data, dtype='double')
print(series)

Printing for double
0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

**5.Reading Data from a CSV File**

import pandas as pd

##### Reading data from a CSV file
df = pd.read_csv('path_to_your_file.csv')

##### Displaying the first 5 rows of the DataFrame
print(df.head())

**Explanation:**
- `pd.read_csv()`: This function reads the CSV file from the given path and returns a pandas DataFrame.
Replace 'path_to_your_file.csv' with the actual path to your CSV file.
- `df.head()`: This will display the first 5 rows of the DataFrame, helping you quickly inspect the content.

In [430]:
import pandas as pd

# Specify the path to your CSV file
csv_file_path = r'I:\Full-Stack-Data-Science & Generative AI\Jupyter-Notebook Notes\2. Python for Data Science\indian_cities.csv'

# Reading the CSV file into a DataFrame
df_cities = pd.read_csv(csv_file_path)

# Displaying the first few rows of the DataFrame
print(df_cities.head())

        City  Population  Area (sq km)  Avg Temp (°C)
0     Mumbai    20411000           603           26.0
1      Delhi    16787941          1484           25.5
2  Bangalore     8443675           709           24.0
3    Kolkata    14900000           185           26.5
4    Chennai     7090000           426           27.0

_______________

**Accessing Series Elements :**

**Access single element by index label:**

In [52]:
import pandas as pd

# Create a Series with custom index
data = [10, 20, 30, 40, 50]
s = pd.Series(data, index=["a", "b", "c", "d", "e"])

# Access single element by index label
print(s["b"])

20

**Access multiple elements by index label**

In [53]:
# Access multiple elements by index labels
data = [10, 20, 30, 40, 50]
s = pd.Series(data, index=["a", "b", "c", "d", "e"])
print(s[["a", "c", "e"]])

a    10
c    30
e    50
dtype: int64

**Accessing Elements by Position:**

**Access single element by position:**

In [302]:
# Access single element by position
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s[1])  # Output: 20

20

C:\Users\silve\AppData\Local\Temp\ipykernel_14756\2956202867.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[1])  # Output: 20

**Access multiple elements by position:**

In [316]:
# Access multiple elements by position
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s[[0, 2, 4]])  # Output: 10, 30, 50

a    10
c    30
e    50
dtype: int64

C:\Users\silve\AppData\Local\Temp\ipykernel_14756\1816013259.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[[0, 2, 4]])  # Output: 10, 30, 50

**Slicing a Series**

**Slice by index position:**

In [58]:
# Slice by index position
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s[1:4])  # Output: elements from index 1 to 3 (positions 1 to 3)

b    20
c    30
d    40
dtype: int64

**Slice by index label:**

In [59]:
# Slice by index label (inclusive of both start and end)

data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s["b":"d"])  # Output: elements from index "b" to "d"

b    20
c    30
d    40
dtype: int64

**Accessing Series using `loc[]` and `iloc[]`**
- `loc[]` is used to access elements by index labels.
- `iloc[]`is used to access elements by position.

**label-based access:**

In [61]:
# Using loc[] for label-based access
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s.loc["c"])  # Output: 30

30

**label-based slicing:**

In [62]:
# Using loc[] for label-based slicing
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s.loc["b":"d"]) 
# Output: elements from index "b" to "d"

b    20
c    30
d    40
dtype: int64

**Position-based-Access:**

In [63]:
# Using iloc[] for position-based access
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s.iloc[2])  # Output: 30

30

**position-based slicing:**

In [64]:
# Using iloc[] for position-based slicing
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s.iloc[1:4])  # Output: elements from position 1 to 3

b    20
c    30
d    40
dtype: int64

**Boolean Indexing**

In [66]:
# Example: Select all elements greater than 30
data = [10, 20, 30, 40, 50]

s = pd.Series(data, index=["a", "b", "c", "d", "e"])

print(s[s > 30])  # Output: elements with values greater than 30

d    40
e    50
dtype: int64

________________

## **Pandas DataFrame :**
- A pandas **DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure** with **labeled axes (rows and columns).** 
- It's one of the most commonly used **objects for data manipulation and analysis in Python.**

**Key Features of a DataFrame:**
- It can **hold data of different types (integers, floats, strings, etc.)**.
- It has **labeled axes** (rows and columns).
- It supports operations like **filtering, grouping, reshaping, and joining data.**

**1. Creating a DataFrame**
        
There are several ways to create a DataFrame, such as using a dictionary, a list of lists, or reading data from external files (CSV, Excel, etc.).

**i) Create a DataFrame from a dictionary**
- You can create a DataFrame from a dictionary where **keys are the column names** and **values** are lists representing the **column data**.

In [71]:
# Printing series
data = {'column_1':[10,20],'column_2':[30,40]}
series= pd.Series(data)
print(series)

column_1    [10, 20]
column_2    [30, 40]
dtype: object

**Dataframe Creation :**

In [73]:
# Printing DataFrame

data = {'column_1':[16,25],'column_2':[36,49]}
dataframe= pd.DataFrame(data)
print(dataframe)

   column_1  column_2
0        16        36
1        25        49

**Type**

In [75]:
type(dataframe)

pandas.core.frame.DataFrame

**Shape**

In [77]:
dataframe.shape

(2, 2)

In [78]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {
    'Name': ['John', 'Jane', 'Tom', 'Anna'],
    'Age': [23, 28, 30, 22],
    'City': ['New York', 'Paris', 'London', 'Tokyo']
}

df = pd.DataFrame(data)
print(df)

   Name  Age      City
0  John   23  New York
1  Jane   28     Paris
2   Tom   30    London
3  Anna   22     Tokyo

**2.Create a DataFrame from a list of lists**

In [80]:
# Creating a DataFrame from a list of lists
data = [['John', 23, 'New York'], ['Jane', 28, 'Paris'], ['Tom', 30, 'London'], ['Anna', 22, 'Tokyo']]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

   Name  Age      City
0  John   23  New York
1  Jane   28     Paris
2   Tom   30    London
3  Anna   22     Tokyo

**3. Create a DataFrame using 2-D Array**

In [82]:
import numpy as np
import pandas as pd

# Creating a 2D NumPy array
arr_2d = np.array([[1, 2, 3], [4, 5, 6]])

# Creating a DataFrame from the NumPy array
dataframe = pd.DataFrame(arr_2d, index=["r1", "r2"], columns=["c1", "c2", "c3"])

# Printing the DataFrame
print(dataframe)

    c1  c2  c3
r1   1   2   3
r2   4   5   6

In [83]:
import pandas as pd

# Creating a DataFrame
dataframe = pd.DataFrame({
    'Age': [10, 15, 20, 25],
    'Name': ['John', 'Alexa', 'Bob', 'Elias'],
    'Gender': ['Male', 'Female', 'Male', 'Male'],
    'Salary': [25000, 15000, 12000, 8000]
})

# Printing the DataFrame
print(dataframe)

   Age   Name  Gender  Salary
0   10   John    Male   25000
1   15  Alexa  Female   15000
2   20    Bob    Male   12000
3   25  Elias    Male    8000

**Set Index:**

In [85]:
import pandas as pd

# Creating a DataFrame
dataframe = pd.DataFrame({
    'Age': [10, 15, 20, 25],
    'Name': ['John', 'Alexa', 'Bob', 'Elias'],
    'Gender': ['Male', 'Female', 'Male', 'Male'],
    'Salary': [25000, 15000, 12000, 8000]
})

# Set the 'Age' column as the index (without modifying the original DataFrame)
dataframe_1 = dataframe.set_index("Age")
# Printing the modified DataFrame with 'Age' as the index
print(dataframe_1)

      Name  Gender  Salary
Age
10    John    Male   25000
15   Alexa  Female   15000
20     Bob    Male   12000
25   Elias    Male    8000

**Reset Index :**

In [87]:
dataframe_1.reset_index()

   Age   Name  Gender  Salary
0   10   John    Male   25000
1   15  Alexa  Female   15000
2   20    Bob    Male   12000
3   25  Elias    Male    8000

## **Basic DataFrame Operations**
- Once a DataFrame is created, you can perform many operations to explore, manipulate, and transform the data.

In [327]:
import pandas as pd

# Creating a DataFrame with  city names and parameters
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata', 'Chennai', 'Hyderabad', 'Ahmedabad', 'Pune'],
    'Population': [20411000, 16787941, 8443675, 14900000, 7090000, 6809970, 5570585, 3124458],  # Population as of 2021 estimates
    'Area (sq km)': [603, 1484, 709, 185, 426, 650, 464, 729],  # Area in square kilometers
    'Avg Temp (°C)': [26.0, 25.5, 24.0, 26.5, 27.0, 25.5, 28.0, 24.5]  # Average temperature
}
# Creating the DataFrame
df_cities = pd.DataFrame(data)

# Displaying the DataFrame
print(df_cities)

        City  Population  Area (sq km)  Avg Temp (°C)
0     Mumbai    20411000           603           26.0
1      Delhi    16787941          1484           25.5
2  Bangalore     8443675           709           24.0
3    Kolkata    14900000           185           26.5
4    Chennai     7090000           426           27.0
5  Hyderabad     6809970           650           25.5
6  Ahmedabad     5570585           464           28.0
7       Pune     3124458           729           24.5

**a.) Summary Information**

In [330]:
import pandas as pd

# Creating a DataFrame with  city names and parameters
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata', 'Chennai', 'Hyderabad', 'Ahmedabad', 'Pune'],
    'Population': [20411000, 16787941, 8443675, 14900000, 7090000, 6809970, 5570585, 3124458],  # Population as of 2021 estimates
    'Area (sq km)': [603, 1484, 709, 185, 426, 650, 464, 729],  # Area in square kilometers
    'Avg Temp (°C)': [26.0, 25.5, 24.0, 26.5, 27.0, 25.5, 28.0, 24.5]  # Average temperature
}
# Creating the DataFrame
df_cities = pd.DataFrame(data)

df_cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   City           8 non-null      object
 1   Population     8 non-null      int64
 2   Area (sq km)   8 non-null      int64
 3   Avg Temp (°C)  8 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 388.0+ bytes

**Unique Values :**

In [333]:
import pandas as pd

# Creating a DataFrame with city names and parameters
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata', 'Chennai', 'Hyderabad', 'Ahmedabad', 'Pune'],
    'Population': [20411000, 16787941, 8443675, 14900000, 7090000, 6809970, 5570585, 3124458],  # Population as of 2021 estimates
    'Area (sq km)': [603, 1484, 709, 185, 426, 650, 464, 729],  # Area in square kilometers
    'Avg Temp (°C)': [26.0, 25.5, 24.0, 26.5, 27.0, 25.5, 28.0, 24.5]  # Average temperature
}

# Creating the DataFrame
df_cities = pd.DataFrame(data)

# Getting unique values for the 'City' column
unique_cities = df_cities['City'].unique()

# Printing unique city names
print("Unique cities:", unique_cities)

# Getting unique values for the 'Avg Temp (°C)' column
unique_temps = df_cities['Avg Temp (°C)'].unique()

# Printing unique temperatures
print("Unique average temperatures:", unique_temps)

Unique cities: ['Mumbai' 'Delhi' 'Bangalore' 'Kolkata' 'Chennai' 'Hyderabad' 'Ahmedabad'
 'Pune']
Unique average temperatures: [26.  25.5 24.  26.5 27.  28.  24.5]

**b.) Viewing Data:**
- **First few rows:**

In [336]:
df_cities.head()   

# # Default shows first 5 rows

        City  Population  Area (sq km)  Avg Temp (°C)
0     Mumbai    20411000           603           26.0
1      Delhi    16787941          1484           25.5
2  Bangalore     8443675           709           24.0
3    Kolkata    14900000           185           26.5
4    Chennai     7090000           426           27.0

In [338]:
df_cities.head(10)

## First 10 rows

        City  Population  Area (sq km)  Avg Temp (°C)
0     Mumbai    20411000           603           26.0
1      Delhi    16787941          1484           25.5
2  Bangalore     8443675           709           24.0
3    Kolkata    14900000           185           26.5
4    Chennai     7090000           426           27.0
5  Hyderabad     6809970           650           25.5
6  Ahmedabad     5570585           464           28.0
7       Pune     3124458           729           24.5

- **Last Few Rows**

In [341]:
df_cities.tail()

# Last 5 rows

        City  Population  Area (sq km)  Avg Temp (°C)
3    Kolkata    14900000           185           26.5
4    Chennai     7090000           426           27.0
5  Hyderabad     6809970           650           25.5
6  Ahmedabad     5570585           464           28.0
7       Pune     3124458           729           24.5

In [343]:
df_cities.tail(2)
# Last 2 rows

        City  Population  Area (sq km)  Avg Temp (°C)
6  Ahmedabad     5570585           464           28.0
7       Pune     3124458           729           24.5

____________________

**c.) Descriptive statistics**

In [347]:
#Summary Of Data.
df_cities.describe()

         Population  Area (sq km)  Avg Temp (°C)
count  8.000000e+00      8.000000        8.00000
mean   1.039220e+07    656.250000       25.87500
std    6.155181e+06    379.505599        1.30247
min    3.124458e+06    185.000000       24.00000
25%    6.500124e+06    454.500000       25.25000
50%    7.766838e+06    626.500000       25.75000
75%    1.537199e+07    714.000000       26.62500
max    2.041100e+07   1484.000000       28.00000

**Group by and aggregate:**

In [350]:
import pandas as pd

# Creating a DataFrame with city names and parameters
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata', 'Chennai', 'Hyderabad', 'Ahmedabad', 'Pune'],
    'Population': [20411000, 16787941, 8443675, 14900000, 7090000, 6809970, 5570585, 3124458],  # Population as of 2021 estimates
    'Area (sq km)': [603, 1484, 709, 185, 426, 650, 464, 729],  # Area in square kilometers
    'Avg Temp (°C)': [26.0, 25.5, 24.0, 26.5, 27.0, 25.5, 28.0, 24.5]  # Average temperature
}

# Creating the DataFrame
df_cities = pd.DataFrame(data)

# Grouping by 'City' (although this dataset has unique cities, this is just for demo)
# Using aggregation to get the sum of 'Population' and the mean of 'Avg Temp (°C)'

grouped = df_cities.groupby('City').agg({
    'Population': 'sum',   # Sum of the population for each city
    'Avg Temp (°C)': 'mean'  # Mean of the average temperature for each city
})

# Printing the grouped and aggregated DataFrame
print(grouped)

           Population  Avg Temp (°C)
City
Ahmedabad     5570585           28.0
Bangalore     8443675           24.0
Chennai       7090000           27.0
Delhi        16787941           25.5
Hyderabad     6809970           25.5
Kolkata      14900000           26.5
Mumbai       20411000           26.0
Pune          3124458           24.5

_______

**d.) Selecting Columns**

**For Single Column:**

In [355]:
# Select Single columns
population = df_cities['Population']
print(population)

0    20411000
1    16787941
2     8443675
3    14900000
4     7090000
5     6809970
6     5570585
7     3124458
Name: Population, dtype: int64

**For Multiple Column:**

In [358]:
# Select multiple columns
print(df_cities[['Population', 'City']])

   Population       City
0    20411000     Mumbai
1    16787941      Delhi
2     8443675  Bangalore
3    14900000    Kolkata
4     7090000    Chennai
5     6809970  Hyderabad
6     5570585  Ahmedabad
7     3124458       Pune

___________

**e.) Selecting Rows:**

**For Single Row:**

In [363]:
# Select a single row by index
print(df_cities.iloc[0])  # Select the first row

City               Mumbai
Population       20411000
Area (sq km)          603
Avg Temp (°C)        26.0
Name: 0, dtype: object

**Accessing Row By label :**

In [366]:
delhi_row = df_cities.loc[df_cities['City'] == 'Delhi']
print(delhi_row)

    City  Population  Area (sq km)  Avg Temp (°C)
1  Delhi    16787941          1484           25.5

_____________

**f.)Filtering Data**
- Filter rows based on conditions:

In [370]:
high_population = df_cities[df_cities['Population'] > 8000000]
print(high_population)

        City  Population  Area (sq km)  Avg Temp (°C)
0     Mumbai    20411000           603           26.0
1      Delhi    16787941          1484           25.5
2  Bangalore     8443675           709           24.0
3    Kolkata    14900000           185           26.5

________

**g.) Sorting:**

**Ascending order:**

In [376]:
# Sorting the DataFrame by "Age" in ascending order
sorted_df_Asc = df_cities.sort_values(by="Population", ascending=True)

# Printing the sorted DataFrame
print(sorted_df_Asc)

        City  Population  Area (sq km)  Avg Temp (°C)
7       Pune     3124458           729           24.5
6  Ahmedabad     5570585           464           28.0
5  Hyderabad     6809970           650           25.5
4    Chennai     7090000           426           27.0
2  Bangalore     8443675           709           24.0
3    Kolkata    14900000           185           26.5
1      Delhi    16787941          1484           25.5
0     Mumbai    20411000           603           26.0

**Descending Order:**
- The `sort_values()` method uses the `ascending` parameter to control the order, with `False meaning descending order`.

In [380]:
# Sorting the DataFrame by "Population" in descending order
sorted_df_Desc = df_cities.sort_values(by="Population", ascending=False)

# Printing the sorted DataFrame
print(sorted_df_Desc)

        City  Population  Area (sq km)  Avg Temp (°C)
0     Mumbai    20411000           603           26.0
1      Delhi    16787941          1484           25.5
3    Kolkata    14900000           185           26.5
2  Bangalore     8443675           709           24.0
4    Chennai     7090000           426           27.0
5  Hyderabad     6809970           650           25.5
6  Ahmedabad     5570585           464           28.0
7       Pune     3124458           729           24.5

**h.) Addition :**

**1. Adding a New Row:**
- To add a new row, you can use the `loc[]` method or the `append()` method.

**Using `loc[]` :**

In [385]:
import pandas as pd

# Creating a DataFrame
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata'],
    'Population': [20411000, 16787941, 8443675, 14900000]
}

df = pd.DataFrame(data)

# Adding a new row using loc[]
df.loc[4] = ['Chennai', 7090000]

# Printing the updated DataFrame
print("\nDataFrame after adding a new row:")
print(df)

DataFrame after adding a new row:
        City  Population
0     Mumbai    20411000
1      Delhi    16787941
2  Bangalore     8443675
3    Kolkata    14900000
4    Chennai     7090000

**Using `concat()`:**

In [388]:
import pandas as pd

# Creating a DataFrame
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata'],
    'Population': [20411000, 16787941, 8443675, 14900000]
}

df = pd.DataFrame(data)

# Adding a new row using pd.concat()
new_row = pd.DataFrame({'City': ['Chennai'], 'Population': [7090000]})
df = pd.concat([df, new_row], ignore_index=True)

# Printing the updated DataFrame
print("\nDataFrame after adding a new row:")
print(df)

DataFrame after adding a new row:
        City  Population
0     Mumbai    20411000
1      Delhi    16787941
2  Bangalore     8443675
3    Kolkata    14900000
4    Chennai     7090000

________

**2.Adding New Column :**

In [392]:
import pandas as pd

# Creating a DataFrame
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata'],
    'Population': [20411000, 16787941, 8443675, 14900000]
}

df = pd.DataFrame(data)

# Adding a new column 'Country' with a constant value
df['Country'] = 'India'

# Adding a new column 'Population in Millions' as a calculated column
df['Population in Millions'] = df['Population'] / 1_000_000

# Printing the updated DataFrame
print("DataFrame after adding new columns:")
print(df)

DataFrame after adding new columns:
        City  Population Country  Population in Millions
0     Mumbai    20411000   India               20.411000
1      Delhi    16787941   India               16.787941
2  Bangalore     8443675   India                8.443675
3    Kolkata    14900000   India               14.900000

__________________

**h.) Dropping :**

**Drop Single row :**

In [397]:
import pandas as pd

# Creating a sample DataFrame
dataframe_1 = pd.DataFrame({
    'Age': [10, 15, 20, 25],
    'Name': ['John', 'Alexa', 'Bob', 'Elias'],
    'Gender': ['Male', 'Female', 'Male', 'Male'],
    'Salary': [25000, 15000, 12000, 8000]
})

# Drop the row at index 2
dataframe_1 = dataframe_1.drop(index=2)

# Printing the modified DataFrame
print(dataframe_1)

   Age   Name  Gender  Salary
0   10   John    Male   25000
1   15  Alexa  Female   15000
3   25  Elias    Male    8000

**Drop Multiple Rows :**

In [400]:
import pandas as pd

# Creating a sample DataFrame
dataframe_1 = pd.DataFrame({
    'Age': [10, 15, 20, 25],
    'Name': ['John', 'Alexa', 'Bob', 'Elias'],
    'Gender': ['Male', 'Female', 'Male', 'Male'],
    'Salary': [25000, 15000, 12000, 8000]
})

# Drop multiple rows at indices  0, 1 and 2
dataframe_1 = dataframe_1.drop(index=[0,1,2])

# Printing the modified DataFrame
print(dataframe_1)

   Age   Name Gender  Salary
3   25  Elias   Male    8000

**Dropping Rows with Missing Values**

In [403]:
import pandas as pd

# Creating a DataFrame with some missing values
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', None, 'Chennai', 'Hyderabad'],
    'Population': [20411000, 16787941, None, 14900000, None, 6809970],
    'Avg Temp (°C)': [26.0, 25.5, 24.0, None, 27.0, 25.5]
}

df = pd.DataFrame(data)

# Dropping rows with missing values
df_cleaned = df.dropna()

# Printing the cleaned DataFrame
print("DataFrame after dropping rows with missing values:")
print(df_cleaned)

DataFrame after dropping rows with missing values:
        City  Population  Avg Temp (°C)
0     Mumbai  20411000.0           26.0
1      Delhi  16787941.0           25.5
5  Hyderabad   6809970.0           25.5

**Filling Missing Values with a Specific Value**

In [406]:
import pandas as pd

# Creating a DataFrame with some missing values
data = {
    'City': ['Mumbai', 'Delhi', 'Bangalore', None, 'Chennai', 'Hyderabad'],
    'Population': [20411000, 16787941, None, 14900000, None, 6809970],
    'Avg Temp (°C)': [26.0, 25.5, 24.0, None, 27.0, 25.5]
}

df = pd.DataFrame(data)

# Filling missing values with 0
df_filled = df.fillna(0)

# Printing the DataFrame with filled missing values
print("\nDataFrame after filling missing values with 0:")
print(df_filled)

DataFrame after filling missing values with 0:
        City  Population  Avg Temp (°C)
0     Mumbai  20411000.0           26.0
1      Delhi  16787941.0           25.5
2  Bangalore         0.0           24.0
3          0  14900000.0            0.0
4    Chennai         0.0           27.0
5  Hyderabad   6809970.0           25.5

___________

**Drop Single Column :**

In [410]:
# Creating a sample DataFrame
dataframe_1 = pd.DataFrame({
    'Age': [10, 15, 20, 25],
    'Name': ['John', 'Alexa', 'Bob', 'Elias'],
    'Gender': ['Male', 'Female', 'Male', 'Male'],
    'Salary': [25000, 15000, 12000, 8000]
})

dataframe_1=dataframe_1.drop(columns="Age")
print(dataframe_1)

    Name  Gender  Salary
0   John    Male   25000
1  Alexa  Female   15000
2    Bob    Male   12000
3  Elias    Male    8000

**Drop Multiple Columns:**

In [413]:
import pandas as pd

# Creating a sample DataFrame
dataframe_1 = pd.DataFrame({
    'Age': [10, 15, 20, 25],
    'Name': ['John', 'Alexa', 'Bob', 'Elias'],
    'Gender': ['Male', 'Female', 'Male', 'Male'],
    'Salary': [25000, 15000, 12000, 8000]
})

# Dropping the 'Age' and 'Gender' columns
dataframe_1 = dataframe_1.drop(columns=["Age", "Gender"])

# Printing the modified DataFrame
print(dataframe_1)

    Name  Salary
0   John   25000
1  Alexa   15000
2    Bob   12000
3  Elias    8000

______________

**i.) Combining DataFrames :**

In [417]:
import pandas as pd

# First DataFrame: City Names and Population
df_cities = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Population': [8419600, 3980400, 2716000, 2328000, 1690000]
})

# Second DataFrame: City Names and Humidity
df_humidity = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Humidity': [65, 58, 77, 74, 31]
})

# Concatenating the two DataFrames column-wise (axis=1)
df_combined = pd.concat([df_cities, df_humidity['Humidity']], axis=1)

# Printing the combined DataFrame
print(df_combined)

          City  Population  Humidity
0     New York     8419600        65
1  Los Angeles     3980400        58
2      Chicago     2716000        77
3      Houston     2328000        74
4      Phoenix     1690000        31

**Concept of `concat()`:**
- The `concat()` function in pandas is used to concatenate (or combine) two or more DataFrames. This can be done either:

- **Row-wise (axis=0):** Stacks DataFrames vertically (one below the other).
- **Column-wise (axis=1):** Joins DataFrames side by side (combines column

we will use axis=1 to concatenate the DataFrames column-wise:

**OR**

**Using `Merge()`:**

In [422]:
import pandas as pd

# First DataFrame: City Names and Population
df_cities = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Population': [8419600, 3980400, 2716000, 2328000, 1690000]
})

# Second DataFrame: City Names and Humidity
df_humidity = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Humidity': [65, 58, 77, 74, 31]
})

# Combining the two DataFrames based on the 'City' column
df_combined = pd.merge(df_cities, df_humidity, on="City")

# Printing the combined DataFrame
print(df_combined)

          City  Population  Humidity
0     New York     8419600        65
1  Los Angeles     3980400        58
2      Chicago     2716000        77
3      Houston     2328000        74
4      Phoenix     1690000        31

Here, we use the `merge()` function to combine both DataFrames into a single one, based on the common column "City".

**Explanation of Parameters:**

- `df_cities`: The first DataFrame to merge.
- `df_humidity`: The second DataFrame to merge.
- `on="City"`: Specifies that the common column to merge on is City. This means that the rows will be matched based on the City column.
- The `merge()` operation joins rows that have matching values in the City column, and it includes data from both DataFrames (Population from df_cities and Humidity from df_humidity).

- The result is a combined DataFrame df_combined that includes:

- The `City column` from both `DataFrames`.
- The `Population column` from `df_cities`.
- The `Humidity column` from `df_humidity`.
- The resulting DataFrame looks like this:

In [425]:
# Printing the combined DataFrame
print(df_combined)

          City  Population  Humidity
0     New York     8419600        65
1  Los Angeles     3980400        58
2      Chicago     2716000        77
3      Houston     2328000        74
4      Phoenix     1690000        31

__________

**j.) Joints:**

**1) Left Join :**
A `left join` in pandas using `merge()` ensures that all rows from the left DataFrame (the one specified first) are included in the result, even if there are no corresponding matches in the right DataFrame. Rows from the right DataFrame will only appear in the result if they have a match in the left DataFrame. If there is no match, pandas will fill in the missing values with NaN.

**Example:**

Let’s create two DataFrames. 
- One with city names and population, 
- and another with city names and humidity.
- This time, we'll include an extra city in the left DataFrame that does not exist in the right DataFrame.

In [238]:
import pandas as pd

# First DataFrame: City Names and Population (Left DataFrame)
df_cities = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Austin'],  # Added 'Austin'
    'Population': [8419600, 3980400, 2716000, 2328000, 1690000, 964000]
})

# Second DataFrame: City Names and Humidity (Right DataFrame)
df_humidity = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Humidity': [65, 58, 77, 74, 31]
})

# Performing a Left Join (all rows from df_cities will appear, regardless of match in df_humidity)
df_left_join = pd.merge(df_cities, df_humidity, on="City", how="left")

# Printing the result
print(df_left_join)

          City  Population  Humidity
0     New York     8419600      65.0
1  Los Angeles     3980400      58.0
2      Chicago     2716000      77.0
3      Houston     2328000      74.0
4      Phoenix     1690000      31.0
5       Austin      964000       NaN

**Explanation:**

DataFrames:
- df_cities (left DataFrame) contains the cities: New York, Los Angeles, Chicago, Houston, Phoenix, and Austin (with population data).
- df_humidity (right DataFrame) contains humidity data for only five cities: New York, Los Angeles, Chicago, Houston, and Phoenix.


**Left Join:**
- We performed a **left join** by specifying **how="left".**

- **All rows from the left DataFrame (df_cities) are included in the result.**

- For the rows where there is no matching City in the right DataFrame (df_humidity), the Humidity value is NaN. In this case, "Austin" is present in the left DataFrame but not in the right DataFrame, so its humidity value is NaN.

**How it works:**

- T**he left join ensures that all rows from the left DataFrame (df_cities) are included, even if there’s no matching data in the right DataFrame.**
- Only the matching rows from the right DataFrame (df_humidity) are combined into the result.
For unmatched rows, pandas fills in the missing values with NaN.

**Key Parameters of merge():**
- `on="City"`: Specifies the common column on which the DataFrames will be merged.
- `how="left"`: Indicates a left join, which keeps all rows from the left DataFrame (df_cities), and includes matching rows from the right DataFrame (df_humidity).


**Conclusion:**
In a left join, all rows from the left DataFrame are preserved, and only the matching rows from the right DataFrame are included. When there’s no match, pandas will insert NaN for the missing data. This is useful when you want to ensure that no data is lost from the left DataFrame, even if there isn’t corresponding data in the right DataFrame.

____________

**2. Right join:**

- A right join in pandas using merge() ensures that all rows from the right DataFrame (the one specified second) are included in the result, even if there are no corresponding matches in the left DataFrame. Rows from the left DataFrame will only appear in the result if they have a match in the right DataFrame. If there is no match, pandas will fill in the missing values with NaN.

**Example:**

Let’s create two DataFrames again, this time performing a **right join**, where **we want to keep all rows from the df_humidity DataFrame.**

In [149]:
import pandas as pd

# First DataFrame: City Names and Population (Left DataFrame)
df_cities = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Austin'],  # 'Phoenix' is missing
    'Population': [8419600, 3980400, 2716000, 2328000, 964000]
})

# Second DataFrame: City Names and Humidity (Right DataFrame)
df_humidity = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],  # 'Austin' is missing
    'Humidity': [65, 58, 77, 74, 31]
})

# Performing a Right Join (all rows from df_humidity will appear, regardless of match in df_cities)
df_right_join = pd.merge(df_cities, df_humidity, on="City", how="right")

# Printing the result
print(df_right_join)

          City  Population  Humidity
0     New York   8419600.0        65
1  Los Angeles   3980400.0        58
2      Chicago   2716000.0        77
3      Houston   2328000.0        74
4      Phoenix         NaN        31

**Explanation:**

**DataFrames:**

- df_cities (left DataFrame) contains the cities: New York, Los Angeles, Chicago, Houston, and Austin (with population data).
- df_humidity (right DataFrame) contains humidity data for the cities: New York, Los Angeles, Chicago, Houston, and Phoenix.

**Right Join:**

- We performed a right join by specifying how="right".
- All rows from the right DataFrame (df_humidity) are included in the result.
- For the rows where there is no matching City in the left DataFrame (df_cities), the Population value is NaN.
- In this case, "Phoenix" is present in the right DataFrame but not in the left DataFrame, so its population value is NaN.

**How it works:**

- The right join ensures that all rows from the right DataFrame (df_humidity) are included, even if there’s no matching data in the left DataFrame (df_cities).
- Only the matching rows from the left DataFrame (df_cities) are combined into the result.
- For unmatched rows, pandas fills in the missing values with NaN. In this case, "Austin" is not present in the right DataFrame, so it doesn't appear in the result.


**Result:**

- The final DataFrame contains three columns: City, Population, and Humidity.
Cities that are only in the right DataFrame (like "Phoenix") appear with NaN in the Population column.
- Cities that are only in the left DataFrame (like "Austin") are excluded from the result, because they don't have a match in the right DataFrame.

**Key Parameters of merge():**
- on="City": Specifies the common column on which the DataFrames will be merged.
- how="right": Indicates a right join, which keeps all rows from the right DataFrame -(df_humidity), and includes matching rows from the left DataFrame (df_cities).

**Conclusion:**

In a right join, all rows from the right DataFrame are preserved, and only the matching rows from the left DataFrame are included. When there’s no match, pandas will insert NaN for the missing data. This is useful when you want to make sure no data from the right DataFrame is lost, even if there isn’t corresponding data in the left DataFrame.

___________

**3.Inner Join:**

- An inner join in pandas using the merge() function returns only the rows where there is a match in both DataFrames. Any rows that don't have a match in both DataFrames are excluded from the result.

**Example:**

We will create two DataFrames, one containing city names and population, and another containing city names and humidity. Then we'll perform an inner join to get only the cities that are common in both DataFrames.

In [154]:
import pandas as pd

# First DataFrame: City Names and Population
df_cities = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Austin'],  # 'Phoenix' is missing
    'Population': [8419600, 3980400, 2716000, 2328000, 964000]
})

# Second DataFrame: City Names and Humidity
df_humidity = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],  # 'Austin' is missing
    'Humidity': [65, 58, 77, 74, 31]
})

# Performing an Inner Join (only matching rows will be included)
df_inner_join = pd.merge(df_cities, df_humidity, on="City", how="inner")

# Printing the result
print(df_inner_join)

          City  Population  Humidity
0     New York     8419600        65
1  Los Angeles     3980400        58
2      Chicago     2716000        77
3      Houston     2328000        74

**Explanation:**

**DataFrames:**

- df_cities contains city names and their populations for New York, Los Angeles, Chicago, Houston, and Austin.
- df_humidity contains city names and humidity data for New York, Los Angeles, Chicago, Houston, and Phoenix.

**Inner Join:**

- We performed an inner join by specifying how="inner".
- An inner join returns only the rows that have matching values in both DataFrames.
- Cities that exist in both DataFrames are included in the result (New York, Los Angeles, Chicago, and Houston).
- Cities that exist in only one DataFrame (Austin in df_cities and Phoenix in df_humidity) are excluded from the result.

**How it works:**

- The merge() function matches rows based on the City column from both DataFrames.
- Only rows where the city is present in both DataFrames are included in the resulting DataFrame.
- The resulting DataFrame contains columns for City, Population, and Humidity.

**Key Parameters of merge():**
- on="City": Specifies the common column on which the DataFrames will be merged.
- how="inner": Indicates an inner join, which keeps only the rows that have matching values in both DataFrames.

**Conclusion:**
- In an inner join, only the rows that have matching values in both DataFrames are included in the result.
- Rows that don't have a match in both DataFrames are excluded.
- This is useful when you want to work only with data that exists in both datasets.

____________

**4.Outer Join :**
- An outer join in pandas using the merge() function returns all rows from both DataFrames. If there is no match in either DataFrame, pandas will fill in the missing values with NaN. This is useful when you want to retain all the data from both DataFrames, even if some entries don't have corresponding matches in the other DataFrame.

In [158]:
import pandas as pd

# First DataFrame: City Names and Population
df_cities = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Austin'],  # 'Phoenix' is missing
    'Population': [8419600, 3980400, 2716000, 2328000, 964000]
})

# Second DataFrame: City Names and Humidity
df_humidity = pd.DataFrame({
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],  # 'Austin' is missing
    'Humidity': [65, 58, 77, 74, 31]
})

# Performing an Outer Join (all rows from both DataFrames will appear)
df_outer_join = pd.merge(df_cities, df_humidity, on="City", how="outer")

# Printing the result
print(df_outer_join)

          City  Population  Humidity
0     New York   8419600.0      65.0
1  Los Angeles   3980400.0      58.0
2      Chicago   2716000.0      77.0
3      Houston   2328000.0      74.0
4       Austin    964000.0       NaN
5      Phoenix         NaN      31.0

**Explanation:**

**DataFrames:**

- df_cities contains city names and their populations for New York, Los Angeles, Chicago, Houston, and Austin.
- df_humidity contains city names and humidity data for New York, Los Angeles, Chicago, Houston, and Phoenix.


**Outer Join:**

- We performed an outer join by specifying how="outer".
- An outer join returns all the rows from both DataFrames.
- Cities that exist in both DataFrames are included with complete data.
- Cities that exist in only one DataFrame (Austin in df_cities and Phoenix in df_humidity) are included with NaN in the columns where data is missing.

**How it works:**

- The merge() function matches rows based on the City column from both DataFrames.
- All rows from both DataFrames are retained. Where a match exists, data from both DataFrames is combined. Where no match exists, the missing values are filled with NaN.

**Result:**

- The final DataFrame contains three columns: City, Population, and Humidity.
- "Austin" is included in the result with a NaN in the Humidity column because it doesn’t have a corresponding entry in df_humidity.
- "Phoenix" is included in the result with a NaN in the Population column because it doesn’t have a corresponding entry in df_cities.

**Key Parameters of merge():**
- on="City": Specifies the common column on which the DataFrames will be merged.
- how="outer": Indicates an outer join, which keeps all rows from both DataFrames, regardless of whether they have a match in the other DataFrame.

**Conclusion:**
- In an outer join, all rows from both DataFrames are included in the result, even if they don’t have matching rows in the other DataFrame. Missing values are filled with NaN, which allows you to retain all the data from both DataFrames. This is useful when you want to combine datasets without losing any information, even if some entries don't have corresponding matches in the other dataset.

____________________